src/UKHO.ERPFacade.API/SapXmlTemplates/SAPRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Z_ADDS_MAT_INFO xmlns="urn:sap-com:document:sap:rfc:functions">
      <Z_ADDS_MAT_INFO>
        <IM_MATINFO xmlns="">
         <CORRID>WS78_210_WS92511B</CORRID>
         <NOOFACTIONS>5</NOOFACTIONS>
         <RECDATE>20230328</RECDATE>
         <RECTIME>160000</RECTIME>
         <ORG>UKHO</ORG>
          <ACTIONITEMS xmlns="urn:sap-com:document:sap:rfc:functions">
          </ACTIONITEMS>
        </IM_MATINFO>
      </Z_ADDS_MAT_INFO>
    </Z_ADDS_MAT_INFO>
  </soap:Body>
</soap:Envelope>

